sysbench/results/local/mysql/media/parallel/complex_1.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            459438
        write:                           101291
        other:                           93013
        total:                           653742
    transactions:                        31520  (524.67 per sec.)
    queries:                             653742 (10881.85 per sec.)
    ignored errors:                      1297   (21.59 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0739s
    total number of events:              31520

Latency (ms):
         min:                                   15.05
         avg:                                   95.22
         max:                                 7117.67
         95th percentile:                      193.38
         sum:                              3001387.45

Threads fairness:
    events (avg/stddev):           630.4000/15.20
    execution time (avg/stddev):   60.0277/0.02