sysbench/results/local/mysql/media/parallel/update_2.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           98567
        other:                           0
        total:                           98567
    transactions:                        98567  (1641.79 per sec.)
    queries:                             98567  (1641.79 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0338s
    total number of events:              98567

Latency (ms):
         min:                                    5.50
         avg:                                   30.44
         max:                                  554.65
         95th percentile:                       87.56
         sum:                              3000175.61

Threads fairness:
    events (avg/stddev):           1971.3400/10.35
    execution time (avg/stddev):   60.0035/0.01